## DataFrames
Consider DataFrame as a combination of Series object  put together they share the same index.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame([[10,20,30],[50,60,70],[20,30,40]],columns=['Col1','Col2', 'Col3'])
df

   Col1  Col2  Col3
0    10    20    30
1    50    60    70
2    20    30    40

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.columns#It give the column name

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [5]:
df.dtypes#give us data type of the series element

Col1    int64
Col2    int64
Col3    int64
dtype: object

In [6]:
df.index#dataframe index

RangeIndex(start=0, stop=3, step=1)

In [7]:
df.index=["R1","R2","R3"]#We can change the index of the series 
df

    Col1  Col2  Col3
R1    10    20    30
R2    50    60    70
R3    20    30    40

In [8]:
df.columns=["C1","C2","C3"]
df

    C1  C2  C3
R1  10  20  30
R2  50  60  70
R3  20  30  40

In [9]:
df.index

Index(['R1', 'R2', 'R3'], dtype='object')

In [10]:
df1 = pd.DataFrame(np.random.randn(4,5),index=['R1','R2', 'R3', 'R4'],columns=['C1', 'C2', 'C3', 'C4','C5'],dtype=float)
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R2 -0.548292 -0.547616 -0.151272 -1.458121 -0.938856
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [11]:
df_dict = pd.DataFrame({"Brand":['Samsung','Realme','Mi','Nokia'], 
                 "Camera":[48,24,16,32], "RAM":[6,4,3,4], "Price" : [17500, 12000, 6999, 22000]})
df_dict

     Brand  Camera  RAM  Price
0  Samsung      48    6  17500
1   Realme      24    4  12000
2       Mi      16    3   6999
3    Nokia      32    4  22000

## Selecting Columns

In [12]:
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R2 -0.548292 -0.547616 -0.151272 -1.458121 -0.938856
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [13]:
df1["C3"]#To select particular column

R1    0.745863
R2   -0.151272
R3    0.134763
R4   -0.948860
Name: C3, dtype: float64

In [14]:
#Pass a list of columns name
df1[["C2",'C5']]

          C2        C5
R1  0.914637 -0.158065
R2 -0.547616 -0.938856
R3 -1.843722 -1.482812
R4  1.131662 -0.613757

In [15]:
#Similar to SQl syntax(NOT RECOMMENDED)
df1.C1

R1   -0.266566
R2   -0.548292
R3   -0.076550
R4   -0.683793
Name: C1, dtype: float64

In [16]:
type(df1["C2"])

pandas.core.series.Series

In [17]:
type(df1[["C2","C5"]])

pandas.core.frame.DataFrame

## Creating a new column

In [18]:
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R2 -0.548292 -0.547616 -0.151272 -1.458121 -0.938856
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [19]:
df1["C6"]=df1["C2"]+df1["C4"]-df1["C1"]
df1

          C1        C2        C3        C4        C5        C6
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065  1.055475
R2 -0.548292 -0.547616 -0.151272 -1.458121 -0.938856 -1.457445
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812 -1.819842
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757  1.262108

## Removing columns and rows

In [20]:
df1.drop("R2")
#To remove the row but not refelect in original data frame bcoz inplace by defoult it is false

          C1        C2        C3        C4        C5        C6
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065  1.055475
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812 -1.819842
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757  1.262108

In [21]:
df1

          C1        C2        C3        C4        C5        C6
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065  1.055475
R2 -0.548292 -0.547616 -0.151272 -1.458121 -0.938856 -1.457445
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812 -1.819842
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757  1.262108

In [22]:
df1.drop(["R2"],inplace=True)#to  reflect in original data we use inplace=True,axis=0 for index remove but dont need bcoz by defoult it is 0

In [23]:
df1

          C1        C2        C3        C4        C5        C6
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065  1.055475
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812 -1.819842
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757  1.262108

In [24]:
df1.drop("C6",axis=1,inplace=True)#For column remove we use axis=1 ,inplace=True to reflect in original dataframe

In [25]:
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

## Selecting rows

In [26]:
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [27]:
df1.loc["R1"]

C1   -0.266566
C2    0.914637
C3    0.745863
C4   -0.125728
C5   -0.158065
Name: R1, dtype: float64

In [28]:
df1.loc[["R3","R1"]]#Lock takes indexes as input in datafrme which we mention

          C1        C2        C3        C4        C5
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065

In [29]:
df1.iloc[0]#Accessing rows based off of position instead  of label

C1   -0.266566
C2    0.914637
C3    0.745863
C4   -0.125728
C5   -0.158065
Name: R1, dtype: float64

In [30]:
print(df1)
df1.iloc[:2]#It give index from 0 to 1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812

In [31]:
df1.iloc[:,2:]

          C3        C4        C5
R1  0.745863 -0.125728 -0.158065
R3  0.134763 -0.052669 -1.482812
R4 -0.948860 -0.553347 -0.613757

In [32]:
df1.iloc[:2,2:4]#it give index 0 to 1 and column 2 to 3

          C3        C4
R1  0.745863 -0.125728
R3  0.134763 -0.052669

In [33]:
df1.loc["R3","C4"]#Selecting subset of rows and column

-0.05266901925168625

In [34]:
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [35]:
df1.loc[["R1","R3"],["C1","C3"]]

          C1        C3
R1 -0.266566  0.745863
R3 -0.076550  0.134763

## Filtering data based on condition(Conditional Selection)

In [36]:
df1

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [37]:
df1>0.3

       C1     C2     C3     C4     C5
R1  False   True   True  False  False
R3  False  False  False  False  False
R4  False   True  False  False  False

In [38]:
df1[df1>0.3]

    C1        C2        C3  C4  C5
R1 NaN  0.914637  0.745863 NaN NaN
R3 NaN       NaN       NaN NaN NaN
R4 NaN  1.131662       NaN NaN NaN

In [39]:
df1[df1<0]

          C1        C2       C3        C4        C5
R1 -0.266566       NaN      NaN -0.125728 -0.158065
R3 -0.076550 -1.843722      NaN -0.052669 -1.482812
R4 -0.683793       NaN -0.94886 -0.553347 -0.613757

In [40]:
df1["C1"]>0.3

R1    False
R3    False
R4    False
Name: C1, dtype: bool

In [41]:
df1[df1["C1"]>-0.3]#returns the rows which satisfied the condition

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812

In [42]:
print(df1)
df1[df1["C1"]>0.3]["C1"]

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

Series([], Name: C1, dtype: float64)

In [43]:
print(df1)
df1[df1["C1"]<0.3][["C1","C2","C5"]]

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

          C1        C2        C5
R1 -0.266566  0.914637 -0.158065
R3 -0.076550 -1.843722 -1.482812
R4 -0.683793  1.131662 -0.613757

In [44]:
print(df1)
df1[(df1["C2"]>-1) & (df1["C5"]<1)]

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757

In [45]:
df1[(df1["C2"]>1.0) | (df1["C1"]<0.3)]

          C1        C2        C3        C4        C5
R1 -0.266566  0.914637  0.745863 -0.125728 -0.158065
R3 -0.076550 -1.843722  0.134763 -0.052669 -1.482812
R4 -0.683793  1.131662 -0.948860 -0.553347 -0.613757